"""
Link element
"""
import allure
from playwright.sync_api import expect
from elements.base_element import BaseElement

#=======================================================================================================================
class Link(BaseElement):
    """
    - ❌ НЕ ВЫЗЫВАТЬ НАПРЯМУЮ базовые методы из Родительского класса - BaseElement()!
    - ✅ Вызывать ТОЛЬКО ЧЕРЕЗ ЭТОТ Дочерний класс элемента!
    """
    pass

#=======================================================================================================================
